app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_classes_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Big Mac's "], ["room_number", 5], ["created_at", "2020-02-25 21:53:51.760919"], ["updated_at", "2020-02-25 21:53:51.760919"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_classes_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 7], ["updated_at", "2020-02-25 22:02:00.665723"], ["id", 5]]